Autodesk.Revit.UI.FormaNotificationManager.PostNotification(System.String,System.String,System.String,System.String,System.String,Autodesk.Revit.UI.FormaNotificationIcon,Autodesk.Revit.UI.FormaNotificationDuration)
Post a notification to Revit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.UI.FormaNotificationManager.RegisterExtCallback(Autodesk.Revit.UI.IFormaNotificationManagerCallback)
Set the external callback.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.FormaNotificationManager.GetCallback
Get the current external callback.
Since:
2027

Autodesk.Revit.UI.FormaNotificationManager.GetInstance
Get a reference to the FormaNotificationManager singleton.
Since:
2027

Autodesk.Revit.UI.FormaNotificationManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.FormaNotificationManager
General Forma UI Notification manager for Revit.
Since:
2027